ads/mergesort.html
---
layout: page
title: Mergesort
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Mergesort</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>geg:</b> Feld \(A\) mit \(n \in \mathbb{N}\) Elementen.
</p>

<p>
<b>Idee:</b> Wenn \(A\) mindestens weniger als 1 Element enthält, tue nichts,
denn dann ist \(A\) sortiert und keine weiteren Schritte sind nötig. Wenn
\(A\) mindestens \(n \geq 2\) Elemente enthält:
</p>

<ol class="org-ol">
<li>teile \(A\) in zwei Teilfelder \(S_{1}\) mit
\(\lfloor \frac{n}{2} \rfloor\) Elementen und \(S_{2}\) mit
\(\lceil \frac{n}{2} \rceil\) auf.
</li>
<li>sortiere \(S_{1}\) rekursiv (wie \(A\))
</li>
<li>sortiere \(S_{2}\) rekursiv (wie \(A\))
</li>
<li>verbinde \(S_{1}\) und \(S_{2}\) zu einem sortierten Feld der Länge \(n\).
</li>
</ol>

<pre class="example">
Mergesort(S) {
  integer n = length(s);
  integer m, i; // for loops
  if (n &gt;= 2) then 
    m = n div 2;
    erzeuge ein Feld  d S1 mit m Elementen;
    erzeuge ein Feld  d S2 mit n-m Elementen;
    for i = 0 to m-1 do
      S1[i] = S[i]
    od
    for i = 0 to n-m-1 do
      S2[i] = S[m+i];
    od
    Mergesort(S1);
    Mergesort(S2);
    Merge(S1, S2, S);
  fi
}
</pre>

<pre class="example">
Merge(S1, S2, S) {
</pre>
</div>
</div>
